////打印杨辉三角
//#include<stdio.h>
//int main()
//{
//	int arr[10][10] = { 0 };
//	int i = 0;
//	int j = 0;
//	//对角线元素置1，第一列置1
//	for (i = 0; i < 10; i++) 
//	{
//		arr[i][0] =  1 ;
//		arr[i][i] =  1 ;
//	}
//	//第三行第二列元素等于第二行第二列元素+第二行第一列元素，之后部分值也这么求
//	for (i = 2; i < 10; i++)
//	{
//		for (j = 1; j <= i; j++)
//			{
//				arr[i][j] = arr[i-1][j ] + arr[i - 1][j - 1];
//			}
//	}	
//	//打印
//		for (i = 0; i < 10; i++)
//		{
//			for (j = 0; j <=i; j++)
//			{
//
//				printf("%5d", arr[i][j]);
//			}
//			printf("\n");
//		}
//		return 0;
//}


//方法2
//#include<stdio.h>
//int main()
//{
//	int arr[10][10] = { 0 };
//	int i = 0;
//	int j = 0;
//	//第三行第二列元素等于第二行第二列元素+第二行第一列元素，之后部分值也这么求
//	for (i = 0; i < 10; i++)
//	{
//		for (j = 0; j <= i; j++)
//		{
//			//对角线元素置1，第一列置1
//			if (i == j)
//			{
//				arr[i][j] = 1;
//			}
//			if (j == 0)
//			{
//				arr[i][j] = 1;
//			}
//			if (i >= 2 && j >= 1)
//			{
//				arr[i][j] = arr[i - 1][j] + arr[i - 1][j - 1];
//			}
//		}
//	}
//	//打印
//	for (i = 0; i < 10; i++)
//	{
//		for (j = 0; j <= i; j++)
//		{
//
//			printf("%5d", arr[i][j]);
//		}
//		printf("\n");
//	}
//	return 0;
//}



//日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个嫌疑犯的一个。
//以下为4个嫌疑犯的供词:A说：不是我。B说：是C。C说：是D。D说：C在胡说
//已知3个人说了真话，1个人说的是假话。
//现在请根据这些信息，写一个程序来确定到底谁是凶手。
//#include<stdio.h>
//int main()
//{
//	int killer = 'A';
//	//假设第一个人士凶手，判断每个人说的话，然后在判断第二个人，直到找到符合的
//	for (killer = 'A'; killer <= 'D'; killer++)
//	{
//		if (((killer != 'A') + (killer == 'C') + (killer == 'D') + (killer != 'D')) == 3)
//		{
//			printf("%c\n", killer);
//		}
//	}
//	return 0;
//}




//5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果：A选手说：B第二，我第三；B选手说：我第二，E第四；
//C选手说：我第一，D第二；D选手说：C最后，我第三；E选手说：我第四，A第一；比赛结束后，
//每位选手都说对了一半，请编程确定比赛的名次。
#include<stdio.h>
int main()
{
	int a = 0;
	int b = 0;
	int c = 0;
	int d = 0;
	int e = 0;
	for (a = 1; a <= 5; a++)
	{
		for (b = 1; b <= 5; b++)
		{
			for (c = 1; c <= 5; c++)
			{
				for (d = 1; d <= 5; d++)
				{
					for (e = 1; e <= 5; e++)
					{
						if (((b == 2) + (a == 3) == 1) &&
							((b == 2) + (e == 4) == 1) &&
							((c == 1) + (d == 2) == 1) &&
							((c == 5) + (d == 3) == 1) &&
							((e == 4) + (a == 1) == 1))
						{
							if (a * b * c * d * e == 120)
								printf("a=%d b=%d c=%d d=%d e=%d\n", a, b, c, d, e);
						}
					}
				}
			}
		}
	}
	return 0;
}